<a href="https://colab.research.google.com/github/harshmangal1108/specialization/blob/master/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
df=pd.read_csv('com.csv')  #reading CSV file

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [0]:
##df.pd.read_csv("url") # TAKING DATA FROM A OPEN URL

In [0]:
#  TO PRINT ALL THE DATA

df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
print(df)    #TO PRINT IN DIFF FORMATS

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
# TO PRINT TOP  ROWS
df.head(3)
df.head(-2)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100
3    Little John        Foo  Robin Hood     100

In [0]:
  # TO PRINT COLUMNS PARTICULAR
  df["Name"]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
# FOR SELECTING ROWS AND COLUMNS
df.iloc[:,0]             #INDEXLOCATION  >>ILOC

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
df.iloc[:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [0]:
print(df.iloc[:,0:2])

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [0]:
df.iloc[0:,[1,3]]

  Department  Salary
0        NaN     200
1        Bar      50
2        Foo     100
3        Foo     100
4        NaN     250
5        Foo      50

In [0]:
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [0]:
df['Salary'].max()      #TO CHECK MAXIMUM FROM A PARTICULAR
df['Salary'].min()       #FOR MINIMUM
df.values                  #IN NUMPY FORMAT OR ARRAY

array([['Robin Hood', nan, nan, 200],
       ['Arsene Wenger', 'Bar', 'Friar Tuck', 50],
       ['Friar Tuck', 'Foo', 'Robin Hood', 100],
       ['Little John', 'Foo', 'Robin Hood', 100],
       ['Sam Allardyce', nan, nan, 250],
       ['Dimi Berbatov', 'Foo', 'Little John', 50]], dtype=object)

In [0]:
df['Salary'].values   #TO MAKE ARRAY OF THAT

array([200,  50, 100, 100, 250,  50])